7767517
252 288
Input                    in0                      0 1 in0
Split                    splitncnn_0              1 2 in0 1 2
Crop                     slice_0                  1 1 2 3 -23310=1,-233 -23311=1,1 -23309=1,0
Split                    splitncnn_1              1 2 3 4 5
Crop                     slice_1                  1 1 5 6 -23310=1,-233 -23311=1,2 -23309=1,0
Crop                     slice_2                  1 1 1 7 -23310=1,-233 -23311=1,1 -23309=1,1
Split                    splitncnn_2              1 2 7 8 9
Crop                     slice_3                  1 1 9 10 -23310=1,-233 -23311=1,2 -23309=1,0
Crop                     slice_4                  1 1 4 11 -23310=1,-233 -23311=1,2 -23309=1,1
Crop                     slice_5                  1 1 8 12 -23310=1,-233 -23311=1,2 -23309=1,1
Concat                   cat_0                    4 1 6 10 11 12 13 0=0
Convolution              conv_0                   1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=3456
Swish                    silu_70                  1 1 14 15
Convolution              conv_1                   1 1 15 16 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_71                  1 1 16 17
Split                    splitncnn_3              1 2 17 18 19
Convolution              conv_2                   1 1 19 20 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_72                  1 1 20 21
Split                    splitncnn_4              1 2 21 22 23
Convolution              conv_3                   1 1 23 24 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_73                  1 1 24 25
Convolution              conv_4                   1 1 25 26 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_74                  1 1 26 27
BinaryOp                 add_0                    2 1 22 27 28 0=0
Convolution              conv_5                   1 1 18 29 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_75                  1 1 29 30
Concat                   cat_1                    2 1 28 30 31 0=0
Convolution              conv_6                   1 1 31 32 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_76                  1 1 32 33
Convolution              conv_7                   1 1 33 34 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_77                  1 1 34 35
Split                    splitncnn_5              1 2 35 36 37
Convolution              conv_8                   1 1 37 38 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_78                  1 1 38 39
Split                    splitncnn_6              1 2 39 40 41
Convolution              conv_9                   1 1 41 42 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_79                  1 1 42 43
Convolution              conv_10                  1 1 43 44 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_80                  1 1 44 45
BinaryOp                 add_1                    2 1 40 45 46 0=0
Split                    splitncnn_7              1 2 46 47 48
Convolution              conv_11                  1 1 48 49 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_81                  1 1 49 50
Convolution              conv_12                  1 1 50 51 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_82                  1 1 51 52
BinaryOp                 add_2                    2 1 47 52 53 0=0
Split                    splitncnn_8              1 2 53 54 55
Convolution              conv_13                  1 1 55 56 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_83                  1 1 56 57
Convolution              conv_14                  1 1 57 58 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_84                  1 1 58 59
BinaryOp                 add_3                    2 1 54 59 60 0=0
Convolution              conv_15                  1 1 36 61 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_85                  1 1 61 62
Concat                   cat_2                    2 1 60 62 63 0=0
Convolution              conv_16                  1 1 63 64 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_86                  1 1 64 65
Split                    splitncnn_9              1 2 65 66 67
Convolution              conv_17                  1 1 67 68 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_87                  1 1 68 69
Split                    splitncnn_10             1 2 69 70 71
Convolution              conv_18                  1 1 71 72 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_88                  1 1 72 73
Split                    splitncnn_11             1 2 73 74 75
Convolution              conv_19                  1 1 75 76 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_89                  1 1 76 77
Convolution              conv_20                  1 1 77 78 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_90                  1 1 78 79
BinaryOp                 add_4                    2 1 74 79 80 0=0
Split                    splitncnn_12             1 2 80 81 82
Convolution              conv_21                  1 1 82 83 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_91                  1 1 83 84
Convolution              conv_22                  1 1 84 85 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_92                  1 1 85 86
BinaryOp                 add_5                    2 1 81 86 87 0=0
Split                    splitncnn_13             1 2 87 88 89
Convolution              conv_23                  1 1 89 90 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_93                  1 1 90 91
Convolution              conv_24                  1 1 91 92 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_94                  1 1 92 93
BinaryOp                 add_6                    2 1 88 93 94 0=0
Convolution              conv_25                  1 1 70 95 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_95                  1 1 95 96
Concat                   cat_3                    2 1 94 96 97 0=0
Convolution              conv_26                  1 1 97 98 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_96                  1 1 98 99
Split                    splitncnn_14             1 2 99 100 101
Convolution              conv_27                  1 1 101 102 0=512 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=1179648
Swish                    silu_97                  1 1 102 103
Convolution              conv_28                  1 1 103 104 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_98                  1 1 104 105
Split                    splitncnn_15             1 4 105 106 107 108 109
Pooling                  maxpool2d_64             1 1 109 110 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Pooling                  maxpool2d_65             1 1 108 111 0=0 1=9 11=9 12=1 13=4 2=1 3=4 5=1
Pooling                  maxpool2d_66             1 1 107 112 0=0 1=13 11=13 12=1 13=6 2=1 3=6 5=1
Concat                   cat_4                    4 1 106 110 111 112 113 0=0
Convolution              conv_29                  1 1 113 114 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=524288
Swish                    silu_99                  1 1 114 115
Split                    splitncnn_16             1 2 115 116 117
Convolution              conv_30                  1 1 117 118 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_100                 1 1 118 119
Convolution              conv_31                  1 1 119 120 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_101                 1 1 120 121
Convolution              conv_32                  1 1 121 122 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_102                 1 1 122 123
Convolution              conv_33                  1 1 116 124 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_103                 1 1 124 125
Concat                   cat_5                    2 1 123 125 126 0=0
Convolution              conv_34                  1 1 126 127 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_104                 1 1 127 128
Convolution              conv_35                  1 1 128 129 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_105                 1 1 129 130
Split                    splitncnn_17             1 2 130 131 132
Interp                   interpolate_62           1 1 132 133 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_6                    2 1 133 100 134 0=0
Split                    splitncnn_18             1 2 134 135 136
Convolution              conv_36                  1 1 136 137 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_106                 1 1 137 138
Convolution              conv_37                  1 1 138 139 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_107                 1 1 139 140
Convolution              conv_38                  1 1 140 141 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_108                 1 1 141 142
Convolution              conv_39                  1 1 135 143 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_109                 1 1 143 144
Concat                   cat_7                    2 1 142 144 145 0=0
Convolution              conv_40                  1 1 145 146 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_110                 1 1 146 147
Convolution              conv_41                  1 1 147 148 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_111                 1 1 148 149
Split                    splitncnn_19             1 2 149 150 151
Interp                   interpolate_63           1 1 151 152 0=1 1=2.000000e+00 2=2.000000e+00 6=0
Concat                   cat_8                    2 1 152 66 153 0=0
Split                    splitncnn_20             1 2 153 154 155
Convolution              conv_42                  1 1 155 156 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_112                 1 1 156 157
Convolution              conv_43                  1 1 157 158 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_113                 1 1 158 159
Convolution              conv_44                  1 1 159 160 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_114                 1 1 160 161
Convolution              conv_45                  1 1 154 162 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_115                 1 1 162 163
Concat                   cat_9                    2 1 161 163 164 0=0
Convolution              conv_46                  1 1 164 165 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_116                 1 1 165 166
Split                    splitncnn_21             1 2 166 167 168
Convolution              conv_47                  1 1 168 169 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_117                 1 1 169 170
Concat                   cat_10                   2 1 170 150 171 0=0
Split                    splitncnn_22             1 2 171 172 173
Convolution              conv_48                  1 1 173 174 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_118                 1 1 174 175
Convolution              conv_49                  1 1 175 176 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_119                 1 1 176 177
Convolution              conv_50                  1 1 177 178 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_120                 1 1 178 179
Convolution              conv_51                  1 1 172 180 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_121                 1 1 180 181
Concat                   cat_11                   2 1 179 181 182 0=0
Convolution              conv_52                  1 1 182 183 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_122                 1 1 183 184
Split                    splitncnn_23             1 2 184 185 186
Convolution              conv_53                  1 1 186 187 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=589824
Swish                    silu_123                 1 1 187 188
Concat                   cat_12                   2 1 188 131 189 0=0
Split                    splitncnn_24             1 2 189 190 191
Convolution              conv_54                  1 1 191 192 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_124                 1 1 192 193
Convolution              conv_55                  1 1 193 194 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_125                 1 1 194 195
Convolution              conv_56                  1 1 195 196 0=256 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=589824
Swish                    silu_126                 1 1 196 197
Convolution              conv_57                  1 1 190 198 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_127                 1 1 198 199
Concat                   cat_13                   2 1 197 199 200 0=0
Convolution              conv_58                  1 1 200 201 0=512 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=262144
Swish                    silu_128                 1 1 201 202
Convolution              conv_59                  1 1 167 203 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32640
Reshape                  reshape_132              1 1 203 204 0=80 1=80 11=85 2=3
Permute                  permute_129              1 1 204 205 0=3
Split                    splitncnn_25             1 2 205 out1 207
Sigmoid                  sigmoid_67               1 1 207 208
Split                    splitncnn_26             1 2 208 209 210
Crop                     slice_6                  1 1 210 211 -23310=1,2 -23311=1,3 -23309=1,0
MemoryData               /model.24/Constant_7_output_0 0 1 212 0=2 1=80 11=80 2=1
BinaryOp                 mul_7                    1 1 211 213 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_8                    1 1 213 214 0=1 1=1 2=5.000000e-01
BinaryOp                 add_9                    2 1 214 212 215 0=0
BinaryOp                 mul_10                   1 1 215 216 0=2 1=1 2=8.000000e+00
Tensor.expand            Tensor.expand_129        1 1 216 217
MemoryData               /model.24/Concat_output_0 0 1 218
ScatterND                ScatterND_220            3 1 209 218 217 219
Split                    splitncnn_27             1 2 219 220 221
Crop                     slice_7                  1 1 221 222 -23310=1,4 -23311=1,3 -23309=1,2
pnnx.Attribute           onnx::Mul_947            0 1 223
BinaryOp                 mul_11                   1 1 222 224 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_12                   1 1 224 225 0=4
BinaryOp                 mul_13                   2 1 225 223 226 0=2
Tensor.expand            Tensor.expand_130        1 1 226 227
pnnx.Attribute           /model.24/Concat_2_output_0 0 1 228
ScatterND                ScatterND_227            3 1 220 228 227 229
Reshape                  reshape_133              1 1 229 230 0=85 1=19200
Convolution              conv_60                  1 1 185 231 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65280
Reshape                  reshape_134              1 1 231 232 0=40 1=40 11=85 2=3
Permute                  permute_130              1 1 232 233 0=3
Split                    splitncnn_28             1 2 233 out2 235
Sigmoid                  sigmoid_68               1 1 235 236
Split                    splitncnn_29             1 2 236 237 238
Crop                     slice_8                  1 1 238 239 -23310=1,2 -23311=1,3 -23309=1,0
pnnx.Attribute           /model.24/Constant_69_output_0 0 1 240
BinaryOp                 mul_14                   1 1 239 241 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_15                   1 1 241 242 0=1 1=1 2=5.000000e-01
BinaryOp                 add_16                   2 1 242 240 243 0=0
BinaryOp                 mul_17                   1 1 243 244 0=2 1=1 2=1.600000e+01
Tensor.expand            Tensor.expand_131        1 1 244 245
pnnx.Attribute           /model.24/Concat_4_output_0 0 1 246
ScatterND                ScatterND_240            3 1 237 246 245 247
Split                    splitncnn_30             1 2 247 248 249
Crop                     slice_9                  1 1 249 250 -23310=1,4 -23311=1,3 -23309=1,2
pnnx.Attribute           onnx::Mul_978            0 1 251
BinaryOp                 mul_18                   1 1 250 252 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_19                   1 1 252 253 0=4
BinaryOp                 mul_20                   2 1 253 251 254 0=2
Tensor.expand            Tensor.expand_132        1 1 254 255
pnnx.Attribute           /model.24/Concat_6_output_0 0 1 256
ScatterND                ScatterND_247            3 1 248 256 255 257
Reshape                  reshape_135              1 1 257 258 0=85 1=4800
Convolution              conv_61                  1 1 202 259 0=255 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=130560
Reshape                  reshape_136              1 1 259 260 0=20 1=20 11=85 2=3
Permute                  permute_131              1 1 260 261 0=3
Split                    splitncnn_31             1 2 261 out3 263
Sigmoid                  sigmoid_69               1 1 263 264
Split                    splitncnn_32             1 2 264 265 266
Crop                     slice_10                 1 1 266 267 -23310=1,2 -23311=1,3 -23309=1,0
pnnx.Attribute           /model.24/Constant_131_output_0 0 1 268
BinaryOp                 mul_21                   1 1 267 269 0=2 1=1 2=2.000000e+00
BinaryOp                 sub_22                   1 1 269 270 0=1 1=1 2=5.000000e-01
BinaryOp                 add_23                   2 1 270 268 271 0=0
BinaryOp                 mul_24                   1 1 271 272 0=2 1=1 2=3.200000e+01
Tensor.expand            Tensor.expand_133        1 1 272 273
pnnx.Attribute           /model.24/Concat_8_output_0 0 1 274
ScatterND                ScatterND_260            3 1 265 274 273 275
Split                    splitncnn_33             1 2 275 276 277
Crop                     slice_11                 1 1 277 278 -23310=1,4 -23311=1,3 -23309=1,2
pnnx.Attribute           onnx::Mul_1009           0 1 279
BinaryOp                 mul_25                   1 1 278 280 0=2 1=1 2=2.000000e+00
UnaryOp                  pow_26                   1 1 280 281 0=4
BinaryOp                 mul_27                   2 1 281 279 282 0=2
Tensor.expand            Tensor.expand_134        1 1 282 283
pnnx.Attribute           /model.24/Concat_10_output_0 0 1 284
ScatterND                ScatterND_267            3 1 276 284 283 285
Reshape                  reshape_137              1 1 285 286 0=85 1=1200
Concat                   cat_14                   3 1 230 258 286 out0 0=0
